For **part-1** Notebook please refer **Mynotebook** [Link](https://github.com/bjagadeeshb/postgreSQL-usnig-Jupyternotebook)

**TABLE OF CONTENTS**

* **INNER JOIN**

* **LEFT OUTER JOIN OR LEFT JOIN**

* **RIGHT OUTER JOIN OR RIGHT JOIN**

* **FULL OUTER JOIN OR FULL JOIN**

* **CROSS JOIN**

* **SELF JOIN**

* **NATURAL JOIN**

* **ADD COLUMN**

* **UPDATE data in the Column**

* **DROP COLUMN**

* **RENAME COLUMN NAME**

* **RENAME TABLE NAME**

* **TURNCATE TABLE**

* **DELETE TABLE**

* **DROP TABLE**

* **PRIMARY ONSTRAINTS**

* **FOREIGN CONSTRAINTS**

* **UNIQUE ONSTRAINTS**

* **CHECK ONSTRAINTS**

* **NOT-NULL ONSTRAINTS**

In [1]:
%load_ext sql

In [2]:
import psycopg2

In [3]:
%sql postgresql://postgres:JaGGu2405@localhost:5432/postgres

For compete detailes of how to connenct SQL to JupyterNotebook you can refer my GitHug [Link](https://github.com/bjagadeeshb/Run-postgreSQL-on-JupyterNotebook)

**Conditional Expression using the CASE clause + Exercise**

**Joins** 
* joins used to join data from multiple tables,Whenever the need to retrieve data from one or more tables. In PostgreSQL, join data from different tables combined using common columns from different tables.

In [4]:
#While joining two tables in PostgreSQL, we need have to use the primary key from the first table and the foreign key from the second table.

**We have different types of joins they are**

* INNER JOIN
* LEFT OUTER JOIN OR LEFT JOIN
* RIGHT OUTER JOIN OR RIGHT JOIN
* FULL OUTER JOIN OR FULL JOIN
* CROSS JOIN

In [6]:
#Will create few tables for crossjoin purpose

In [8]:
%%sql
CREATE TABLE crossjoin_student(
rollno int PRIMARY KEY,
firstname VARCHAR (50) NOT NULL,
lastname VARCHAR (50),
branch_id int NOT NULL,
result boolean,
joining_date DATE NOT NULL
);
CREATE TABLE crossjoin_Branch(
branch_id int primary key,
branch VARCHAR (50) NOT NULL
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.
Done.

[]

In [9]:
%%sql
INSERT INTO crossjoin_Branch (branch_id, branch)
values
('1',  'Civil'),
('2', 'Computer'),
('3', 'IT'),
('4',  'Mechanical'),
('5',  'Eletrical');
INSERT INTO crossjoin_student (rollno, firstname, lastname, branch_id, result, joining_date)
values
('101', 'Oliver','Jake', '1', false, '06-01-2020'),
('102', 'Jack','Connor', '1', false, '06-01-2020'),
('103', 'Harry','Callum', '2', false, '06-01-2020'),
('104', 'Jacob','John', '2', false, '06-01-2020'),
('105', 'Thomas','David', '3', false, '06-01-2020');

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.
5 rows affected.

[]

In [10]:
%%sql
SELECT * FROM crossjoin_student

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(101, 'Oliver', 'Jake', 1, False, datetime.date(2020, 1, 6)),
 (102, 'Jack', 'Connor', 1, False, datetime.date(2020, 1, 6)),
 (103, 'Harry', 'Callum', 2, False, datetime.date(2020, 1, 6)),
 (104, 'Jacob', 'John', 2, False, datetime.date(2020, 1, 6)),
 (105, 'Thomas', 'David', 3, False, datetime.date(2020, 1, 6))]

if you want to edit the table name

In [12]:
%%sql
Alter table crossjoin_student RENAME TO join_student;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [13]:
%%sql
SELECT * FROM join_student

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(101, 'Oliver', 'Jake', 1, False, datetime.date(2020, 1, 6)),
 (102, 'Jack', 'Connor', 1, False, datetime.date(2020, 1, 6)),
 (103, 'Harry', 'Callum', 2, False, datetime.date(2020, 1, 6)),
 (104, 'Jacob', 'John', 2, False, datetime.date(2020, 1, 6)),
 (105, 'Thomas', 'David', 3, False, datetime.date(2020, 1, 6))]

In [15]:
%%sql
ALTER TABLE crossjoin_Branch RENAME TO joins_Branch

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [16]:
%%sql
SELECT * FROM joins_Branch

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(1, 'Civil'), (2, 'Computer'), (3, 'IT'), (4, 'Mechanical'), (5, 'Eletrical')]

In [18]:
%%sql
select * from join_student inner join joins_Branch ON join_student.branch_id = joins_Branch.branch_id;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(101, 'Oliver', 'Jake', 1, False, datetime.date(2020, 1, 6), 1, 'Civil'),
 (102, 'Jack', 'Connor', 1, False, datetime.date(2020, 1, 6), 1, 'Civil'),
 (103, 'Harry', 'Callum', 2, False, datetime.date(2020, 1, 6), 2, 'Computer'),
 (104, 'Jacob', 'John', 2, False, datetime.date(2020, 1, 6), 2, 'Computer'),
 (105, 'Thomas', 'David', 3, False, datetime.date(2020, 1, 6), 3, 'IT')]

You can add the ORDER BY clause [ASC or DESC ] to sort the result set by branch id as follows:

In [22]:
%%sql
select * from join_student inner join joins_Branch ON join_student.branch_id = joins_Branch.branch_id 
order by joins_branch.branch_id desc;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(105, 'Thomas', 'David', 3, False, datetime.date(2020, 1, 6), 3, 'IT'),
 (103, 'Harry', 'Callum', 2, False, datetime.date(2020, 1, 6), 2, 'Computer'),
 (104, 'Jacob', 'John', 2, False, datetime.date(2020, 1, 6), 2, 'Computer'),
 (101, 'Oliver', 'Jake', 1, False, datetime.date(2020, 1, 6), 1, 'Civil'),
 (102, 'Jack', 'Connor', 1, False, datetime.date(2020, 1, 6), 1, 'Civil')]

**Note:-** Each student will have a branch assigned. The branch_id field establishes the link between two tables. we can use the INNER JOIN clause to joined the student table to the Branch table.

 **OUTER JOIN**
 * outer join is mainly divided into three types 
 * 1.left outer join or left join
 * 2.right outer join or right join
 * 3.full outer join

**Left outer join** is also known as **Left join,** it will retrieve all rows from the left table, and matching rows from the right table. also retrieve all matching records from both the tables, if we want to fetch all record from the first table and doesnâ€™t need any record from the second table then we create left join.

**Note:-**if there are no corresponding records found from the right table, it will return null.

In [23]:
#let's implement outer joins here

In [24]:
#look at the tables that we are going to take in this outerjoin

In [25]:
%%sql
SELECT * FROM emp1

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2))]

In [26]:
%%sql
SELECT * FROM emp2

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2))]

In [31]:
%%sql
Select * from emp1 LEFT OUTER JOIN emp2 ON emp1.emp_id = emp2.emp_id;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), None, None, None, None, None, None),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2))]

**Right Outer join**
* Right JOIN or Right Outer Join is used to return all rows from the right table, and rows from the other table where the join condition is fulfilled defined in the **ON condition.** And if there are no corresponding records found from the Left table, it will return null values.

In [35]:
%%sql
Select * from emp1 RIGHT OUTER JOIN emp2 ON emp1.emp_name = emp2.emp_name;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (None, None, None, None, None, None, 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2))]

In [36]:
%%sql
Select * from emp1 RIGHT OUTER JOIN emp2 ON emp1.emp_address = emp2.emp_address;

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[(2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2))]

**Full Join**
*  Full Join or Full Outer Join is used to return **all records** when there is a match in the left table or right table records. The main objective of a Full Outer Join is that **it will combine the outcome of PostgreSQL Left Join and PostgreSQL Right Join clauses and returns all similar or unmatched rows from the tables on both sides of the join clause.**

* The values which are not matching are set to null values for every column of the table which does not have a matching row. This holds true for the left table and right table. If the Left table values do not match with the right table, they will be marked as null, and similarly, if they do not match the right table, they will be null in the right table.

In [37]:
%%sql
Select * from emp1 FULL OUTER JOIN emp2 ON emp1.emp_id = emp2.emp_id;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2))]

In [38]:
%%sql
Select * from emp1 FULL OUTER JOIN emp2 ON emp1.emp_phone= emp2.emp_phone;

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[(1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2)),
 (1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1))]

**CROSS JOIN**
* The SQL CROSS JOIN produces a result set which is the number of rows in the first table multiplied by the number of rows in the second table if no WHERE clause is used along with CROSS JOIN.This kind of result is called as **Cartesian Product.**

In [39]:
%%sql
Select * from emp1 CROSS JOIN emp2

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[(1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (1, 'ABC       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (2, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(220, 1, 1), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 1, 'PQR       ', 'Pune                ', '1234567890    ', 20000, datetime.date(2020, 1, 1)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 2, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2)),
 (3, 'XYZ       ', 'Mumbai              ', '1234567890    ', 35000, datetime.date(2020, 1, 2), 3, 'BBS       ', 'Mumbai              ', '1234567890    ', 45000, datetime.date(2020, 1, 2))]

**self join**
* A self-join is a regular join that joins a table to itself. In practice, you typically use a self-join to query hierarchical data or to compare rows within the same table.

* To form a self-join, you specify the same table twice with different table aliases and provide the join predicate after the ON keyword.

* **To perform PostgreSQL Self join, the same table must be listed in the query twice with different alias.**

**Natural Joins**
* If we create a SQL statement having an asterisk (*) instead of column names in the SELECT clause with the NATURAL JOIN operation, then the columns will be considered in the following order for an asterisk (*) :

* All the common columns from the left (first) table and right (second) table.
* Every column in the left (first) table which is not common with the right (second) table columns.
* Every column in the second (right) table which is not common with the left (first) table columns.
* In PostgreSQL, the NATURAL JOIN is an INNER JOIN where we combine all columns with the same name in both tables.

In [43]:
%%sql
select * from transaction;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'Purchase of Mobile'),
 (2, 'Purchase of PC'),
 (3, 'Purchase of Headphone')]

In [44]:
%%sql
select * from invoices;

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(1, 1, 'Purchase of Mobile'),
 (2, 1, 'Purchase of Mobile'),
 (3, 2, 'Purchase of PC'),
 (4, 2, 'Purchase of PC'),
 (5, 3, 'Purchase of Headphone'),
 (6, 3, 'Purchase of Headphone')]

In [45]:
%%sql
SELECT * FROM invoices
NATURAL JOIN transaction;

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(1, 1, 'Purchase of Mobile', 'Purchase of Mobile'),
 (1, 2, 'Purchase of Mobile', 'Purchase of Mobile'),
 (2, 3, 'Purchase of PC', 'Purchase of PC'),
 (2, 4, 'Purchase of PC', 'Purchase of PC'),
 (3, 5, 'Purchase of Headphone', 'Purchase of Headphone'),
 (3, 6, 'Purchase of Headphone', 'Purchase of Headphone')]

**ADD COLUMN**

In [46]:
%%sql
SELECT * FROM transaction

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'Purchase of Mobile'),
 (2, 'Purchase of PC'),
 (3, 'Purchase of Headphone')]

In [47]:
%%sql 
ALTER TABLE transaction
ADD COLUMN name varchar(20)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [48]:
%%sql
SELECT * from transaction

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'Purchase of Mobile', None),
 (2, 'Purchase of PC', None),
 (3, 'Purchase of Headphone', None)]

**NOTE:-** U CAN WRITE LOWER CASE OR UPPER CASE LETTERS, but when it comes to attributes name we need to follow letters

**UPDATE data in the Column**

* if you want to add or update the data in the given column

In [69]:
%%sql
UPDATE transaction  
SET name = 'Jagadeesh'  
WHERE  
transaction_id = 1;
  
UPDATE transaction   
SET name = 'swathi'  
WHERE  
transaction_id = 2; 
  
UPDATE transaction   
SET name = 'santhu'  
WHERE  
transaction_id = 3;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [70]:
%%sql 
select * from transaction

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'Purchase of Mobile', 'Jagadeesh'),
 (2, 'Purchase of PC', 'swathi'),
 (3, 'Purchase of Headphone', 'santhu')]

**DROP COLUMN**

In [71]:
%%sql
ALTER TABLE transaction   
DROP COLUMN name;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [72]:
%%sql
select * from transaction

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'Purchase of Mobile'),
 (2, 'Purchase of PC'),
 (3, 'Purchase of Headphone')]

**RENAME COLUMN NAME**

In [74]:
%%sql
ALTER TABLE transaction 
RENAME COLUMN transaction_data TO transaction_info;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [75]:
%%sql
select * from transaction

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[(1, 'Purchase of Mobile'),
 (2, 'Purchase of PC'),
 (3, 'Purchase of Headphone')]

**TRUNCATE TABLE**
* TRUNCATE TABLE command to delete all records from huge tables quickly.

* To delete all data from a table, we use the DELETE command. When a table contains a lot of records and is also not useful, in that case, we will use the TRUNCATE TABLE command to remove all the records from a particular table.

Even we can rename the table name

* **RENAME TABLE NAME**

In [78]:
%%sql
SELECT * FROM 
ddpues;

 * postgresql://postgres:***@localhost:5432/postgres
13 rows affected.

[(11, 'FRANK'),
 (105, 'JNJB'),
 (12, 'SAM'),
 (16, 'JNJB'),
 (19, 'K'),
 (114, 'RANK'),
 (113, 'FR'),
 (115, 'ANK'),
 (11, 'GINDHABAD'),
 (11, 'JAITELANGANA'),
 (11, 'FRANK'),
 (11, 'FRANK'),
 (11, 'FRANK')]

In [79]:
%%sql
ALTER TABLE ddpues   
RENAME TO jagadeesh_table;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [80]:
%%sql
SELECT * FROM jagadeesh_table;

 * postgresql://postgres:***@localhost:5432/postgres
13 rows affected.

[(11, 'FRANK'),
 (105, 'JNJB'),
 (12, 'SAM'),
 (16, 'JNJB'),
 (19, 'K'),
 (114, 'RANK'),
 (113, 'FR'),
 (115, 'ANK'),
 (11, 'GINDHABAD'),
 (11, 'JAITELANGANA'),
 (11, 'FRANK'),
 (11, 'FRANK'),
 (11, 'FRANK')]

In [81]:
%%sql
TRUNCATE jagadeesh_table

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [82]:
%%sql
select * from jagadeesh_table

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

**DROP TABLE**
* To entirely removing from the database

In [85]:
%%sql
DROP TABLE jagadeesh_table

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [86]:
%%sql
select * from jagadeesh_table

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.UndefinedTable) relation "jagadeesh_table" does not exist
LINE 1: select * from jagadeesh_table
                      ^

[SQL: select * from jagadeesh_table]
(Background on this error at: http://sqlalche.me/e/f405)

In [87]:
# above error is because we successfully removed the table

**NOTE:-** Know the difference B/W **DELETE TABLE**,**TRUNCATE TABLE**, **DROP TABLE**

* **DELETE TABLE:-**  To delete the data from the tables attributes
* **TRUNCATE TABLE:-** To removie all the data from the table
* **DROP TABLE:-** To removie the table

**CONSTRAINTS**
* The constraints are used to describe the rules for the data columns in a table.

* **Not Null**	This type of constraint is used to make sure that a column cannot have a null value. And no name can be further defined to generate a not-null constraint.

* **Check**	It is used to make sure that all values in a column or a field of a table satisfy particular situations such as it must match a Boolean expression. The Check constraint can be defined by a separate name.

* **Unique**	The unique constraints are used to make sure that all values in a column of a table are exclusive.

* **Primary key** The primary key is to specify each row or record in a database table uniquely and make sure that there is no record duplicity in a particular table.

* **Foreign key**	In PostgreSQL, the foreign key is used to define that the value in a column or field of a table is equal to the real value of the primary key of another table.

* **Exclusion**	This constraint is used to make sure that any two rows are linked on the precise columns or statements with the help of defined operators, and one of these operator assessments should return either Null or False.

**will discuess about CASE CLAUSE, indeses, trigger and shema in next notebook.**